{
  "items": [
    {
      "name": "LiveDocs",
      "imgs": [
        {
          "src": "/img/projects/livedocs/livedocs-editor.png"
        },
        {
          "src": "/img/projects/livedocs/livedocs-editor.png"
        },
        {
          "src": "/img/projects/livedocs/livedocs-editor.png"
        },
        {
          "src": "/img/projects/livedocs/livedocs-editor.png"
        }
      ],
      "heroImg": "/img/projects/livedocs/livedocs-editor.png",
      "tech": "React - Next.js - TailwindCSS - LiveBlocks",
      "smallText": "Совместная работа с документами в реальном времени: вход через Google, редактирование, комментарии и уведомления.",
      "bigText": [
        "LiveDocs — это редактор документов с совместной работой в реальном времени, разработанный с использованием современных технологий: Next.js, TypeScript и Tailwind CSS. Проект демонстрирует мои навыки создания масштабируемых и интерактивных веб-приложений с чистой архитектурой кода и акцентом на удобство пользователя.",
        "Приложение поддерживает безопасную аутентификацию через Google с использованием NextAuth, позволяя пользователям входить в систему и управлять сессиями. Пользователи могут создавать, редактировать, удалять и делиться документами с правами просмотра или редактирования. Все документы автоматически сохраняются и доступны на главной странице.",
        "LiveDocs включает текстовый редактор с поддержкой совместной работы, где несколько пользователей могут одновременно редактировать один и тот же документ. Поддерживаются встроенные и общие комментарии с возможностью ответов, что упрощает коммуникацию.",
        "В реальном времени отображаются активные участники, что усиливает ощущение командной работы. Пользователи получают уведомления о новых комментариях, доступах и действиях других участников.",
        "Приложение полностью адаптивно, корректно работает на всех устройствах и построено с использованием переиспользуемых компонентов и модульной архитектуры."
      ],
      "github": "https://github.com/Anuar7777/livedoc",
      "live": "https://livedoc-git-main-anuars-projects-9f46da88.vercel.app/",
      "openSpan": "Узнать больше"
    }
  ]
}
